# pandas

In [4]:
import numpy as np
import pandas as pd

Series (List 의 기능)

In [5]:
obj = pd.Series([4,7,-5,3])

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
obj.dtype

dtype('int64')

In [16]:
#INDEX 를 특정 문자로 바꿔보기
obj2=pd.Series([4,7,5,3,1],index=['a','b','c','d','e'])

In [18]:
obj2

a    4
b    7
c    5
d    3
e    1
dtype: int64

Dictionary를 Series에 인자로 넣어주면 Series 를 자동 생성된다.

In [21]:
sdata = {"charles":35000,"kilho":71000,"bayung":16000,"sangju":5000}

In [23]:
obj3 = pd.Series(sdata)

In [25]:
obj3

bayung     16000
charles    35000
kilho      71000
sangju      5000
dtype: int64

In [ ]:
INDEX 에 이름을 붙이고 해당

In [26]:
obj3.name = "Salary"
obj3.index.name = "Names"

In [28]:
obj3

Names
bayung     16000
charles    35000
kilho      71000
sangju      5000
Name: Salary, dtype: int64

In [32]:
obj3.index=['a','b','c','d']
obj3

a    16000
b    35000
c    71000
d     5000
Name: Salary, dtype: int64

DataFrame(행렬을 나타내는 것으로 하나의 표를 그린다고 생각하자)

In [42]:
data ={"name":["kilho","kilho","kilho","charles","charles"],
       "year":[2007,2008,2009,2014,2015],
       "points":[1.5,5.2,4.0,7.8,5.2]}

In [44]:
df = pd.DataFrame(data)
df

      name  points  year
0    kilho     1.5  2007
1    kilho     5.2  2008
2    kilho     4.0  2009
3  charles     7.8  2014
4  charles     5.2  2015

In [46]:
#인덱스 정보 확인하기
df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
#열 이름 정보 출력하기
df.columns

Index(['name', 'points', 'year'], dtype='object')

In [50]:
#값을 출력하기
df.values

array([['kilho', 1.5, 2007],
       ['kilho', 5.2, 2008],
       ['kilho', 4.0, 2009],
       ['charles', 7.8, 2014],
       ['charles', 5.2, 2015]], dtype=object)

In [59]:
#이름 주기
df.index.name = "Num"
df.columns.name = "info"
df

info     name  points  year
Num
0       kilho     1.5  2007
1       kilho     5.2  2008
2       kilho     4.0  2009
3     charles     7.8  2014
4     charles     5.2  2015

열 추가하고, 인덱스를 one, two ... 로 바꾸기

In [79]:
df2 = pd.DataFrame(data, columns=["name","points","year","penalty"],
                   index=["one","two","three","four","five"])
df2

          name  points  year penalty
one      kilho     1.5  2007     NaN
two      kilho     5.2  2008     NaN
three    kilho     4.0  2009     NaN
four   charles     7.8  2014     NaN
five   charles     5.2  2015     NaN

In [80]:
df2.values

array([['kilho', 1.5, 2007, nan],
       ['kilho', 5.2, 2008, nan],
       ['kilho', 4.0, 2009, nan],
       ['charles', 7.8, 2014, nan],
       ['charles', 5.2, 2015, nan]], dtype=object)

In [81]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

.describe() #기본 통계 계산

In [78]:
df2.describe() #기본적인 통계 계산

         points         year
count  5.000000     5.000000
mean   4.740000  2010.600000
std    2.282104     3.646917
min    1.500000  2007.000000
25%    4.000000  2008.000000
50%    5.200000  2009.000000
75%    5.200000  2014.000000
max    7.800000  2015.000000

NaN 의 처리 (Not a Number) 및 DataFrame Indexing

    열 선택과 조작, 행 선택과 조작, Boolean Indexing

In [85]:
df2["year"] #원하는 열 조회 방법0

one      2007
two      2008
three    2009
four     2014
five     2015
Name: year, dtype: int64

In [87]:
df2.year #원하는 열 조회 방법1

one      2007
two      2008
three    2009
four     2014
five     2015
Name: year, dtype: int64

In [89]:
df[["year","points"]] #원하는 열 조회

info  year  points
Num
0     2007     1.5
1     2008     5.2
2     2009     4.0
3     2014     7.8
4     2015     5.2

새로운 값 입력하기(penalty 열에 일괄적으로 0.5 대입)

In [94]:
df2["penalty"]=0.5
df2

          name  points  year  penalty
one      kilho     1.5  2007      0.5
two      kilho     5.2  2008      0.5
three    kilho     4.0  2009      0.5
four   charles     7.8  2014      0.5
five   charles     5.2  2015      0.5

새로운 값 입력하기(penalty 열에 순차적으로 원하는 값 입력)

In [97]:
df2["penalty"]=[0.1,0.2,0.3,0.4,0.5]
df2

          name  points  year  penalty
one      kilho     1.5  2007      0.1
two      kilho     5.2  2008      0.2
three    kilho     4.0  2009      0.3
four   charles     7.8  2014      0.4
five   charles     5.2  2015      0.5

zeros 열을 추가하고 순차적인 값 입력하기

In [105]:
df2["zeros"]=np.arange(5)
df2

          name  points  year  penalty  zeros
one      kilho     1.5  2007      0.1      0
two      kilho     5.2  2008      0.2      1
three    kilho     4.0  2009      0.3      2
four   charles     7.8  2014      0.4      3
five   charles     5.2  2015      0.5      4

원하는 행(튜플)에만 자료 추가하기

In [109]:
val = pd.Series([1.2,1.3,1.4],index=['two','four','five'])
df2["debt"]=val
df2

          name  points  year  penalty  zeros  debt
one      kilho     1.5  2007      0.1      0   NaN
two      kilho     5.2  2008      0.2      1   1.2
three    kilho     4.0  2009      0.3      2   NaN
four   charles     7.8  2014      0.4      3   1.3
five   charles     5.2  2015      0.5      4   1.4

In [127]:
#열 추가해보기
df2["score"]=[50,60,70,80,90] 
df2

          name  points  year  penalty  zeros  debt  score
one      kilho     1.5  2007      0.1      0   NaN     50
two      kilho     5.2  2008      0.2      1   1.2     60
three    kilho     4.0  2009      0.3      2   NaN     70
four   charles     7.8  2014      0.4      3   1.3     80
five   charles     5.2  2015      0.5      4   1.4     90

열의 삭제 ※문법주의 (명령어이므로 괄호가 없다.)

In [128]:
del df2["score"]
df2

          name  points  year  penalty  zeros  debt
one      kilho     1.5  2007      0.1      0   NaN
two      kilho     5.2  2008      0.2      1   1.2
three    kilho     4.0  2009      0.3      2   NaN
four   charles     7.8  2014      0.4      3   1.3
five   charles     5.2  2015      0.5      4   1.4

특정 열의 계산 결과를 새로운 열으 값으로 입력하기

In [132]:
df2["net_points"]=df2["points"]-df2["penalty"]
df2

          name  points  year  penalty  zeros  debt  net_points
one      kilho     1.5  2007      0.1      0   NaN         1.4
two      kilho     5.2  2008      0.2      1   1.2         5.0
three    kilho     4.0  2009      0.3      2   NaN         3.7
four   charles     7.8  2014      0.4      3   1.3         7.4
five   charles     5.2  2015      0.5      4   1.4         4.7

Boolean Indexing : 특정 열의 조건에 따라 boolean 반환하기

In [141]:
df2["high_points"]=df2["net_points"]>2.0
df2

          name  points  year  penalty  zeros  debt  net_points  high_points
one      kilho     1.5  2007      0.1      0   NaN         1.4        False
two      kilho     5.2  2008      0.2      1   1.2         5.0         True
three    kilho     4.0  2009      0.3      2   NaN         3.7         True
four   charles     7.8  2014      0.4      3   1.3         7.4         True
five   charles     5.2  2015      0.5      4   1.4         4.7         True

In [142]:
del df2["high_points"]
df2

          name  points  year  penalty  zeros  debt  net_points
one      kilho     1.5  2007      0.1      0   NaN         1.4
two      kilho     5.2  2008      0.2      1   1.2         5.0
three    kilho     4.0  2009      0.3      2   NaN         3.7
four   charles     7.8  2014      0.4      3   1.3         7.4
five   charles     5.2  2015      0.5      4   1.4         4.7

In [ ]:
#이름주기
df2.index.name = "order"
df2.columns.name = "info"
df2

In [146]:
df2[0:3] #0~3 까지 값 출력해보기

info    name  points  year  penalty  zeros  debt  net_points
order
one    kilho     1.5  2007      0.1      0   NaN         1.4
two    kilho     5.2  2008      0.2      1   1.2         5.0
three  kilho     4.0  2009      0.3      2   NaN         3.7

정의한 인덱스의 이름 사이의 튜플을 출력하기

In [149]:
df2["two":"four"]

info      name  points  year  penalty  zeros  debt  net_points
order
two      kilho     5.2  2008      0.2      1   1.2         5.0
three    kilho     4.0  2009      0.3      2   NaN         3.7
four   charles     7.8  2014      0.4      3   1.3         7.4

행 정보 가져오기

In [160]:
df2.loc["two":"two"]

info    name  points  year  penalty  zeros  debt  net_points
order
two    kilho     5.2  2008      0.2      1   1.2         5.0

In [157]:
df2["two":"four"]

info      name  points  year  penalty  zeros  debt  net_points
order
two      kilho     5.2  2008      0.2      1   1.2         5.0
three    kilho     4.0  2009      0.3      2   NaN         3.7
four   charles     7.8  2014      0.4      3   1.3         7.4

In [163]:
df2.loc["two":"four"]

info      name  points  year  penalty  zeros  debt  net_points
order
two      kilho     5.2  2008      0.2      1   1.2         5.0
three    kilho     4.0  2009      0.3      2   NaN         3.7
four   charles     7.8  2014      0.4      3   1.3         7.4

종합 : 원하는 행과, 열의 정보를 가져오기

In [166]:
df2.loc["two":"four","points"]

order
two      5.2
three    4.0
four     7.8
Name: points, dtype: float64

In [169]:
df2.loc[:,"year"] #모든 행의 'year'값 추천하기

order
one      2007
two      2008
three    2009
four     2014
five     2015
Name: year, dtype: int64

In [173]:
df2.loc[:,["year","names"]]

info   year  names
order
one    2007    NaN
two    2008    NaN
three  2009    NaN
four   2014    NaN
five   2015    NaN

In [174]:
df2.loc[:,["year"]]

info   year
order
one    2007
two    2008
three  2009
four   2014
five   2015

In [223]:
#3행에서 5행까지 year, penalty 열 가져오기
df2.loc["three":"five",["year","penalty"]]

info     year  penalty
order
three  2009.0      0.3
four   2014.0      0.4
five   2015.0      0.5

행 추가

In [205]:
df2.loc["six",:]="hayung",6.3,2014,0.3,1.5,5.25,15.0
df2

info      name  points    year  penalty  zeros  debt  net_points
order
one      kilho     1.5  2007.0      0.1    0.0   NaN         1.4
two      kilho     5.2  2008.0      0.2    1.0  1.20         5.0
three    kilho     4.0  2009.0      0.3    2.0   NaN         3.7
four   charles     7.8  2014.0      0.4    3.0  1.30         7.4
five   charles     5.2  2015.0      0.5    4.0  1.40         4.7
six     hayung     6.3  2014.0      0.3    1.5  5.25        15.0

Index 넘버로 자료 조회하기

In [215]:
df2.iloc[3:5,0:2]

info      name  points
order
four   charles     7.8
five   charles     5.2

모든 행의 정보와 3개의 열 순차적으로 표시

.iloc[]                 #Index Number 로 행을 조회할 때 .iloc를 활용한다.

In [218]:
df2.iloc[:,0:3]

info      name  points    year
order
one      kilho     1.5  2007.0
two      kilho     5.2  2008.0
three    kilho     4.0  2009.0
four   charles     7.8  2014.0
five   charles     5.2  2015.0
six     hayung     6.3  2014.0

In [224]:
#인덱스 번호로 행 조회
df2.iloc[[1],0:3]

info    name  points    year
order
two    kilho     5.2  2008.0

In [228]:
df2.loc[df2["year"]>2010,:]

info      name  points    year  penalty  zeros  debt  net_points
order
four   charles     7.8  2014.0      0.4    3.0  1.30         7.4
five   charles     5.2  2015.0      0.5    4.0  1.40         4.7
six     hayung     6.3  2014.0      0.3    1.5  5.25        15.0

In [235]:
#이름이 길호인 행의 name과 points 값만 가져오기
df2.loc[df2["name"]=="kilho",["name","points"]]

info    name  points
order
one    kilho     1.5
two    kilho     5.2
three  kilho     4.0

In [252]:
df2.loc[(df2["points"]>2) & (df2["points"]<6),:]

info      name  points    year  penalty  zeros  debt  net_points
order
two      kilho     5.2  2008.0      0.2    1.0   1.2         5.0
three    kilho     4.0  2009.0      0.3    2.0   NaN         3.7
five   charles     5.2  2015.0      0.5    4.0   1.4         4.7

In [268]:
#points가 3보다 크면 penalty 값을 0 으로 대체
df2.loc[df2["points"]>3,"penalty"]=0
df2

info      name  points    year  penalty  zeros  debt  net_points
order
one      kilho     1.5  2007.0      0.1    0.0   NaN         1.4
two      kilho     5.2  2008.0      0.0    1.0  1.20         5.0
three    kilho     4.0  2009.0      0.0    2.0   NaN         3.7
four   charles     7.8  2014.0      0.0    3.0  1.30         7.4
five   charles     5.2  2015.0      0.0    4.0  1.40         4.7
six     hayung     6.3  2014.0      0.0    1.5  5.25        15.0

결측치(NaN) 처리

.fillna(value=0.0)

In [270]:
df2.fillna(value=0.0)

info      name  points    year  penalty  zeros  debt  net_points
order
one      kilho     1.5  2007.0      0.1    0.0  0.00         1.4
two      kilho     5.2  2008.0      0.0    1.0  1.20         5.0
three    kilho     4.0  2009.0      0.0    2.0  0.00         3.7
four   charles     7.8  2014.0      0.0    3.0  1.30         7.4
five   charles     5.2  2015.0      0.0    4.0  1.40         4.7
six     hayung     6.3  2014.0      0.0    1.5  5.25        15.0

In [289]:
#"two","four","five"에만 값을 넣기
val = pd.Series([1.2,1.3,1.5],index = ["two","four","five"])

two     1.2
four    1.3
five    1.5
dtype: float64

In [291]:
df2["debt"]=val
df2

info      name  points    year  penalty  zeros  debt  net_points
order
one      kilho     1.5  2007.0      0.1    0.0   NaN         1.4
two      kilho     5.2  2008.0      0.0    1.0   1.2         5.0
three    kilho     4.0  2009.0      0.0    2.0   NaN         3.7
four   charles     7.8  2014.0      0.0    3.0   1.3         7.4
five   charles     5.2  2015.0      0.0    4.0   1.5         4.7
six     hayung     6.3  2014.0      0.0    1.5   NaN        15.0

In [292]:
df2.dropna(how="all")

info      name  points    year  penalty  zeros  debt  net_points
order
one      kilho     1.5  2007.0      0.1    0.0   NaN         1.4
two      kilho     5.2  2008.0      0.0    1.0   1.2         5.0
three    kilho     4.0  2009.0      0.0    2.0   NaN         3.7
four   charles     7.8  2014.0      0.0    3.0   1.3         7.4
five   charles     5.2  2015.0      0.0    4.0   1.5         4.7
six     hayung     6.3  2014.0      0.0    1.5   NaN        15.0

In [293]:
df2.isnull()

info    name  points   year  penalty  zeros   debt  net_points
order
one    False   False  False    False  False   True       False
two    False   False  False    False  False  False       False
three  False   False  False    False  False   True       False
four   False   False  False    False  False  False       False
five   False   False  False    False  False  False       False
six    False   False  False    False  False   True       False

In [300]:
df2.loc[df2.isnull()["debt"],["points"]]

info   points
order
one       1.5
three     4.0
six       6.3